StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
/* One-shot timer: defines the 10-second first-cycle duration */
APP_TIMER_DEF(m_first_cycle_timer);

/* Repeated timer: samples Hall during the first cycle */
APP_TIMER_DEF(m_hall_sample_timer);

/* Repeated timer: subsequent Hall + Accelerometer checks */
APP_TIMER_DEF(m_monitoring_timer);

/* =========================================================
 * Application States
 * ========================================================= */

typedef enum
{
    APP_STATE_SLEEP,
    APP_STATE_FIRST_CYCLE,
    APP_STATE_MONITORING,
    APP_STATE_BUZZER

} app_state_t;

/* =========================================================
 * Application Variables
 * ========================================================= */


static volatile bool m_first_cycle_timeout;
static volatile bool m_hall_sample_timeout;
static volatile bool m_monitoring_timeout;
static volatile bool m_pressure_event;
static app_state_t m_app_state = APP_STATE_SLEEP;


static void first_cycle_timer_handler(void * p_context);
static void monitoring_timer_handler(void * p_context);
static void hall_sample_timer_handler(void * p_context);

/* =========================================================
 * Hall Sensor Sample Timer Handler
 *
 * Called every after 0.1 seconds.
 * ========================================================= */

static void hall_sample_timer_handler(void * p_context)
{
    (void)p_context;

    m_hall_sample_timeout = true;
}

/* =========================================================
 * First Cycle Timer Handler
 *
 * Called once after 10 seconds.
 * ========================================================= */

static void first_cycle_timer_handler(void * p_context)
{
    (void)p_context;

    m_first_cycle_timeout = true;
}


/* =========================================================
 * Monitoring Timer Handler
 *
 * Called every 10 seconds.
 * ========================================================= */

static void monitoring_timer_handler(void * p_context)
{
    (void)p_context;

    m_monitoring_timeout = true;
}

/* =========================================================
 * GPIO Interrupt Handler
 *
 * BUTTON_1 currently simulates the Pressure Pad.
 * ========================================================= */

static void pressure_pad_handler(
    nrf_drv_gpiote_pin_t pin,
    nrf_gpiote_polarity_t action)
{
    (void)pin;
    (void)action;

    /*
     * Pressure detected.
     *
     * Do not perform application processing here.
     * Just set a flag.
     */
    m_pressure_event = true;
}

/* =========================================================
 * Initialize GPIOTE
 * ========================================================= */

static void pressure_pad_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();

    /*
     * NRF_ERROR_INVALID_STATE means
     * GPIOTE is already initialized.
     */
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }


    /*
     * HIGH -> LOW interrupt.
     *
     * Internal pull-up enabled.
     *
     * This is suitable for a button connected
     * between GPIO and GND.
     */
    nrf_drv_gpiote_in_config_t config =
        GPIOTE_CONFIG_IN_SENSE_HITOLO(true);

    config.pull = NRF_GPIO_PIN_PULLUP;


    APP_ERROR_CHECK(
        nrf_drv_gpiote_in_init(
            PRESSURE_PAD_PIN,
            &config,
            pressure_pad_handler
        )
    );


    nrf_drv_gpiote_in_event_enable(
        PRESSURE_PAD_PIN,
        true
    );
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    /*
     * First-cycle duration timer.
     *
     * One-shot:
     * expires after 10 seconds.
     */
    APP_ERROR_CHECK(
        app_timer_create(
            &m_first_cycle_timer,
            APP_TIMER_MODE_SINGLE_SHOT,
            first_cycle_timer_handler
        )
    );

    /*
     * Hall sampling timer.
     *
     * Repeated:
     * Hall is checked every 100 ms
     * during the first 10-second cycle.
     */
    APP_ERROR_CHECK(
        app_timer_create(
            &m_hall_sample_timer,
            APP_TIMER_MODE_REPEATED,
            hall_sample_timer_handler
        )
    );

    /*
     * Normal monitoring timer.
     *
     * Repeated:
     * Hall + accelerometer every 10 seconds.
     */
    APP_ERROR_CHECK(
        app_timer_create(
            &m_monitoring_timer,
            APP_TIMER_MODE_REPEATED,
            monitoring_timer_handler
        )
    );
}

/* =========================================================
 * Simulated Hall Sensor Check
 *
 * Later:
 * Replace this with PWM duty cycle measurement.
 * ========================================================= */

static bool hall_sensor_is_valid(void)
{
    hall_sensor_measurement_t measurement;

    if (!hall_sensor_measurement_get(&measurement))
    {
        NRF_LOG_WARNING("No complete Hall PWM sample.");
        return false;
    }

    NRF_LOG_INFO("Hall PWM: %u.%u%%, period: %u ticks",
                 measurement.duty_per_mille / 10U,
                 measurement.duty_per_mille % 10U,
                 measurement.period_ticks);

    return (measurement.duty_per_mille >= HALL_DUTY_MIN_PER_MILLE) &&
           (measurement.duty_per_mille <= HALL_DUTY_MAX_PER_MILLE);
}


/* =========================================================
 * Simulated Accelerometer Check
 *
 * Later:
 * Replace this with actual accelerometer reading.
 * ========================================================= */

static bool accelerometer_is_valid(void)
{
    /*
     * TEMPORARY FOR TESTING
     *
     * true  = Accelerometer is within threshold
     * false = Motion/problem detected
     */

