StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
    return true;
}

/* =========================================================
 * Enable Buzzer
 *
 * LED_1 is currently used to simulate the buzzer.
 * ========================================================= */

static void buzzer_enable(void)
{
    /*
     * Stop all sensor-cycle timers.
     */
    (void)app_timer_stop(m_first_cycle_timer);
    (void)app_timer_stop(m_hall_sample_timer);
    (void)app_timer_stop(m_monitoring_timer);

    /*
     * LED currently simulates buzzer.
     */
    bsp_board_led_on(0);

    m_app_state = APP_STATE_BUZZER;
}


/* =========================================================
 * Disable Buzzer
 * ========================================================= */

static void buzzer_disable(void)
{
    bsp_board_led_off(0);
}

/* =========================================================
 * Start First Cycle
 * ========================================================= */

static void start_first_cycle(void)
{
    m_pressure_event = false;

    m_first_cycle_timeout = false;
    m_hall_sample_timeout = false;

    m_app_state = APP_STATE_FIRST_CYCLE;

    /*
     * Start the 10-second first-cycle duration timer.
     */
    APP_ERROR_CHECK(
        app_timer_start(
            m_first_cycle_timer,
            APP_TIMER_TICKS(FIRST_CYCLE_TIME_MS),
            NULL
        )
    );

    /*
     * Start Hall sampling immediately.
     *
     * First Hall check will happen after 100 ms.
     */
    APP_ERROR_CHECK(
        app_timer_start(
            m_hall_sample_timer,
            APP_TIMER_TICKS(HALL_SAMPLE_PERIOD_MS),
            NULL
        )
    );

    /*
     * Do an immediate Hall check at 0 sec.
     *
     * This is important because the requirement says:
     *
     * Pressure detected
     *      ↓
     * Read Hall immediately
     */
    if (!hall_sensor_is_valid())
    {
        NRF_LOG_INFO("Hall sensor failed at start.");

        buzzer_enable();
    }
}

/* =========================================================
 * Start Monitoring Cycle
 * ========================================================= */

static void start_monitoring(void)
{
    m_monitoring_timeout = false;

    m_app_state = APP_STATE_MONITORING;


    /*
     * Start repeated 10 second timer.
     */
    APP_ERROR_CHECK(
        app_timer_start(
            m_monitoring_timer,
            APP_TIMER_TICKS(MONITORING_PERIOD_MS),
            NULL
        )
    );
}

/**@brief Function starting the internal LFCLK oscillator.
 *
 * @details This is needed by RTC1 which is used by the Application Timer
 *          (When SoftDevice is enabled the LFCLK is always running and this is not needed).
 */
static void lfclk_request(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
    nrf_drv_clock_lfclk_request(NULL);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
    }

}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

